code_breaker_backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", ""], ["LIMIT", 1]]
---
    def create
        user = User.find_by(user_params)
        if user == nil
            user = User.new(user_params)
            user.save
        end
        if user.username == ""
            user = User.find_by(username: "Universal")