code_breaker_backend/app/controllers/users_controller.rb

    def create
        user = User.find_by(user_params)
        if user == nil
            user = User.new(user_params)
            user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", ""], ["created_at", "2020-09-10 21:52:28.611668"], ["updated_at", "2020-09-10 21:52:28.611668"]]